import type { Book } from './types';

export const books: Book[] = [
  {
    title: '速読英単語 必修編 改訂第8版',
    sections: [
      'お茶の木の種類',
      'オオカミの子育て',
      'ビタミンCの働き',
      '服のボタンの位置がもつ意味',
      'drugの定義',
      '本当のほほえみと偽りのほほえみ',
      '遺伝子と行動',
      'ジェンダーバイアスとその克服(1)',
      'ジェンダーバイアスとその克服(2)',
      '風邪に関する常識',
      '食の安全と有機農業(1)',
      '食の安全と有機農業(2)',
      '遊びを通して学ぶこと(1)',
      '遊びを通して学ぶこと(2)',
      '竹は不思議な植物(1)',
      '竹は不思議な植物(2)',
      '胸やけにはレモンを(1)',
      '胸やけにはレモンを(2)',
      'ハエの特殊能力(1)',
      'ハエの特殊能力(2)',
      'ごみゼロへの挑戦(1)',
      'ごみゼロへの挑戦(2)',
      'ネコの習性',
      '国によって異なる笑顔の意味(1)',
      '国によって異なる笑顔の意味(2)',
      '国によって異なる笑顔の意味(3)',
      '読書の重要性(1)',
      '読書の重要性(2)',
      'ダイエットに関する意外な論文(1)',
      'ダイエットに関する意外な論文(2)',
      '科学者セシリア・ペインの学生時代(1)',
      '科学者セシリア・ペインの学生時代(2)',
      '言葉はどれほど人を傷つけるか(1)',
      '言葉はどれほど人を傷つけるか(2)',
      '言葉はどれほど人を傷つけるか(3)',
      '真実を使ったうそ(1)',
      '真実を使ったうそ(2)',
      'フェイクニュースの拡散(1)',
      'フェイクニュースの拡散(2)',
      'メルボルンのデジタル緑化活動(1)',
      'メルボルンのデジタル緑化活動(2)',
      'メルボルンのデジタル緑化活動(3)',
      'hyggeとは(1)',
      'hyggeとは(2)',
      'hyggeとは(3)',
      '「評価」の落とし穴',
      'コーヒーと心臓疾患(1)',
      'コーヒーと心臓疾患(2)',
      'コーヒーと心臓疾患(3)',
      'ウナギの生態(1)',
      'ウナギの生態(2)',
      'ウナギの生態(3)',
      '香りと記憶の関係(1)',
      '香りと記憶の関係(2)',
      'コティングリー妖精事件(1)',
      'コティングリー妖精事件(2)',
      'コティングリー妖精事件(3)',
      '「ゲーム化」する日常生活(1)',
      '「ゲーム化」する日常生活(2)',
      '「ゲーム化」する日常生活(3)',
      'インターネット時代の書籍の役割(1)',
      'インターネット時代の書籍の役割(2)',
      'スポーツに見る男女平等と賃金格差(1)',
      'スポーツに見る男女平等と賃金格差(2)',
      'スポーツに見る男女平等と賃金格差(3)',
      '夏目漱石のロンドン生活(1)',
      '夏目漱石のロンドン生活(2)',
      '夏目漱石のロンドン生活(3)',
      '人間とAIの未来予想(1)',
      '人間とAIの未来予想(2)',
      '人間とAIの未来予想(3)'
    ],
    audios: [
      {
        name: '英文（アメリカ英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu8/sokutan-hisshu8_eibun_A_'
      },
      {
        name: '英文（イギリス英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu8/sokutan-hisshu8_eibun_C_'
      },
      {
        name: '単語（英語のみ）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu8/sokutan-hisshu8_tango1_'
      },
      {
        name: '単語（英語→日本語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu8/sokutan-hisshu8_tango2_'
      },
      {
        name: '単語（日本語→英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu8/sokutan-hisshu8_tango3_'
      },
      {
        name: '例文（英語→日本語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu8/sokutan-hisshu8_reibun_'
      }
    ]
  },
  {
    title: '速読英単語 必修編 改訂第7版増補版',
    sections: [
      'オオカミの子育て',
      'お茶の種類',
      'ジェスチャーの違い',
      'ビタミンCの働き',
      'drugの定義',
      '皮膚の役割',
      '紳士服と婦人服でボタンが違う理由',
      '紫色のもと',
      '本当のほほえみと偽りのほほえみ',
      '「熱い」か「辛い」か',
      '食の安全と有機農業（１）',
      '食の安全と有機農業（２）',
      '数学の歴史（１）',
      '数学の歴史（２）',
      '遺伝子と行動',
      '風邪に関する常識',
      '英単語はいくつあるか（１）',
      '英単語はいくつあるか（２）',
      '結婚式の慣習（１）',
      '結婚式の慣習（２）',
      '遊びを通して学ぶこと（１）',
      '遊びを通して学ぶこと（２）',
      'サッカーの起源（１）',
      'サッカーの起源（２）',
      'ハエの超能力（１）',
      'ハエの超能力（２）',
      'アレルギーが増加する背景（１）',
      'アレルギーが増加する背景（２）',
      '外国語を学ぶ際に必要なもの（１）',
      '外国語を学ぶ際に必要なもの（２）',
      'ディズニーの大きな決断（１）',
      'ディズニーの大きな決断（２）',
      'ディズニーの大きな決断（３）',
      'ネコの習性',
      '「触れること」の作用（１）',
      '「触れること」の作用（２）',
      'インターネット時代の印刷物の役割（１）',
      'インターネット時代の印刷物の役割（２）',
      'つらい経験について書くことの効用（１）',
      'つらい経験について書くことの効用（２）',
      'テレビゲームの影響力（１）',
      'テレビゲームの影響力（２）',
      '真実を使ったうそ（１）',
      '真実を使ったうそ（２）',
      '個人主義と協調主義',
      'テクノロジーは人間の職を奪うか（１）',
      'テクノロジーは人間の職を奪うか（２）',
      '群集心理（１）',
      '群集心理（２）',
      '群集心理（３）',
      'ゴミ０への挑戦（１）',
      'ゴミ０への挑戦（２）',
      'クローン技術の是非（１）',
      'クローン技術の是非（２）',
      'ビタミンAの重要性とサツマイモ（１）',
      'ビタミンAの重要性とサツマイモ（２）',
      'ダイエットに関する意外な論文（１）',
      'ダイエットに関する意外な論文（２）',
      '家族で食事をすることの重要性（１）',
      '家族で食事をすることの重要性（２）',
      'スーパーの便利さと運搬燃料（１）',
      'スーパーの便利さと運搬燃料（２）',
      '熱湯の方がより速く氷になる？（１）',
      '熱湯の方がより速く氷になる？（２）',
      '熱湯の方がより速く氷になる？（３）',
      '読書の重要性（１）',
      '読書の重要性（２）',
      'AIについて（１）',
      'AIについて（２）',
      'ヒトの自然治癒力'
    ],
    audios: [
      {
        name: '英文（アメリカ英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu7/sokutan-hisshu7_eibun_A_'
      },
      {
        name: '英文（イギリス英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu7/sokutan-hisshu7_eibun_C_'
      },
      {
        name: '単語（英語のみ）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu7/sokutan-hisshu7_tango1_'
      },
      {
        name: '単語（英語→日本語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu7/sokutan-hisshu7_tango2_'
      },
      {
        name: '単語（日本語→英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu7/sokutan-hisshu7_tango3_'
      },
      {
        name: '例文（英語→日本語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/hisshu7/sokutan-hisshu7_reibun_'
      }
    ]
  },
  {
    title: '速読英単語 上級編 改訂第5版',
    sections: [
      '人間と動物の違い',
      '蝶が互いを見分ける方法（1）',
      '蝶が互いを見分ける方法（2）',
      '「原始的な」言語（1）',
      '「原始的な」言語（2）',
      '発音と食事の関係（1）',
      '発音と食事の関係（2）',
      '怒りのメカニズム',
      'ユーモアの種類と効能（1）',
      'ユーモアの種類と効能（2）',
      '孤立感（1）',
      '孤立感（2）',
      '暴力はなぜ起きる',
      '謙虚さが教えてくれること（1）',
      '謙虚さが教えてくれること（2）',
      '謙虚さが教えてくれること（3）',
      '人種差別を排除するには（1）',
      '人種差別を排除するには（2）',
      '受刑者に対する実験の是非（1）',
      '受刑者に対する実験の是非（2）',
      'ホーソン効果',
      'ジャンクフードから見る経済格差（1）',
      'ジャンクフードから見る経済格差（2）',
      'ジャンクフードから見る経済格差（3）',
      'ジャンクフードから見る経済格差（4）',
      '適切な塩の摂取量とは（1）',
      '適切な塩の摂取量とは（2）',
      '健康によい運動量の本当の目安（1）',
      '健康によい運動量の本当の目安（2）',
      '健康によい運動量の本当の目安（3）',
      'プラスチックが健康に与える影響（1）',
      'プラスチックが健康に与える影響（2）',
      'プラスチックが健康に与える影響（3）',
      '光害と生態系（1）',
      '光害と生態系（2）',
      '電子決済が幸福感に与える影響（1）',
      '電子決済が幸福感に与える影響（2）',
      '電子決済が幸福感に与える影響（3）',
      '電子決済が幸福感に与える影響（4）',
      '集団規範が創造性を壊す（1）',
      '集団規範が創造性を壊す（2）',
      '音楽がもたらすもの',
      '人間の性としての探検',
      '仕事を喜びにするには（1）',
      '仕事を喜びにするには（2）',
      '責任とは（1）',
      '責任とは（2）',
      '責任とは（3）'
    ],
    audios: [
      {
        name: '英文（アメリカ英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/jokyu5/sokutan-jokyu5_eibun_'
      },
      {
        name: '英文（イギリス英語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/jokyu5/sokutan-jokyu5_eibun_br'
      },
      {
        name: '単語（英語→日本語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/jokyu5/sokutan-jokyu5_tango_'
      },
      {
        name: '例文（英語→日本語）',
        url: 'https://ex2.zkai.co.jp/books/sokutan/jokyu5/sokutan-jokyu5_reibun_'
      }
    ]
  }
];
